---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidHeightabovelevelParam
source: html/f054aeaf-59c1-81f6-6699-bcbeeb14897f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidHeightabovelevelParam Property

"Height Offset From Level"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidHeightabovelevelParam { get; }
```